userapi-performance-test/test.yml
execution:
- executor: newman
#  concurrency: 2
#  ramp-up: 10s
#  hold-for: 30s
  iterations: 5
  scenario: simple

scenarios:
  simple:
    script: collection.json
    environment: ci.json
    think-time: 0.75

modules:
  blazemeter:
    token: 2c24146301d8c02466a79366:d5861138ddde70b091d76ac488df24f47491d9a0282900aa7a29e1c7b40157fab8a5c95e
  newman:
    tools-dir: /usr/src/app

reporting:
- module: blazemeter
  test: CI
  project: USERAPI
- module: junit-xml
  filename: /tmp/artifacts/outputfile.xml